
# int 
number = 12 # Принимает любое целочисленное значение, положительное и отрицательное
# Допускает над собой все соответствующие математические операции

# str 
some_string = "Some string 123" # Строка
another_string = some_string.replace(" ", "") # С помощью метода replace() удаляем в строке пробелы
# Присваиваем результат работы метода новой переменной
print(another_string)  # Выводим результат в терминал

# Метод Dir выводит в терминал список всех методов, применимых к переменной данного типа

